#include "stdafx.h"

//---------------------------------------------------------------------------------
// 持失切
//---------------------------------------------------------------------------------
CLanServer::CLanServer()
{

}

//---------------------------------------------------------------------------------
// 社瑚切
//---------------------------------------------------------------------------------
CLanServer::~CLanServer()
{

}

bool	CLanServer::Start(WCHAR *wOpenIP, int iPort, int iWorkerThdNum, bool bNagle, int iMaxConnection)
{

}

void	CLanServer::Stop()
{

}
